11/data/attachments/436a04733b4908b4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Richard_which_Friend_11999_8</nif:username>
            <nif:friendToBeRequested>soap_friends_4a30ecd8-5f2c-444f-848c-1a470a06c87e</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>